---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.StairsType
source: html/99f36e3f-97a8-f4df-f49f-70b94c9d013d.htm
---
# StairsType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.